In [2]:
import sqlite3

In [3]:
connection = sqlite3.connect('students.db')
cursor = connection.cursor()

# Create table
cursor.execute('''
CREATE TABLE IF NOT EXISTS students(
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT NOT NULL,
    age INTEGER,
    grade TEXT
)
''')

connection.commit()

In [4]:
## Insert a single row
cursor.execute("INSERT INTO students (name, age, grade) VALUES (?, ?, ?)", ("Alice", 20, "A"))
connection.commit()

In [5]:
## Insert multiple rows
students = [('Bob',21,'B'),('Charlie',22,'A'),('Dausy',19,'C')]
cursor.executemany("INSERT INTO students (name,age,grade) VALUES (?,?,?)",students)
connection.commit()

In [6]:
## Read Data (SELECT)

cursor.execute("SELECT * FROM students")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Alice', 20, 'B+')
(2, 'Bob', 21, 'B')
(4, 'Dausy', 19, 'C')
(5, 'EVA', 23, 'A')
(6, 'Ravi', 21, 'B')
(7, 'Sneha', 20, 'C')
(8, 'Zoya', 19, 'A')
(9, 'Ravi', 21, 'B')
(10, 'Sneha', 20, 'C')
(11, 'Zoya', 19, 'A')
(12, 'EVA', 23, 'A')
(13, 'Ravi', 21, 'B')
(14, 'Sneha', 20, 'C')
(15, 'Zoya', 19, 'A')
(16, 'Ravi', 21, 'B')
(17, 'Sneha', 20, 'C')
(18, 'Zoya', 19, 'A')
(19, 'Ravi', 21, 'B')
(20, 'Sneha', 20, 'C')
(21, 'Zoya', 19, 'A')
(22, 'Alice', 20, 'A')
(23, 'Bob', 21, 'B')
(24, 'Charlie', 22, 'A')
(25, 'Dausy', 19, 'C')

In [7]:
## Fetch with filter

cursor.execute("SELECT * FROM students WHERE grade ='A'")
for row in cursor.fetchall():
    print(rows)

[(1, 'Alice', 20, 'B+'), (2, 'Bob', 21, 'B'), (4, 'Dausy', 19, 'C'), (5, 'EVA', 23, 'A'), (6, 'Ravi', 21, 'B'), (7, 'Sneha', 20, 'C'), (8, 'Zoya', 19, 'A'), (9, 'Ravi', 21, 'B'), (10, 'Sneha', 20, 'C'), (11, 'Zoya', 19, 'A'), (12, 'EVA', 23, 'A'), (13, 'Ravi', 21, 'B'), (14, 'Sneha', 20, 'C'), (15, 'Zoya', 19, 'A'), (16, 'Ravi', 21, 'B'), (17, 'Sneha', 20, 'C'), (18, 'Zoya', 19, 'A'), (19, 'Ravi', 21, 'B'), (20, 'Sneha', 20, 'C'), (21, 'Zoya', 19, 'A'), (22, 'Alice', 20, 'A'), (23, 'Bob', 21, 'B'), (24, 'Charlie', 22, 'A'), (25, 'Dausy', 19, 'C')]
[(1, 'Alice', 20, 'B+'), (2, 'Bob', 21, 'B'), (4, 'Dausy', 19, 'C'), (5, 'EVA', 23, 'A'), (6, 'Ravi', 21, 'B'), (7, 'Sneha', 20, 'C'), (8, 'Zoya', 19, 'A'), (9, 'Ravi', 21, 'B'), (10, 'Sneha', 20, 'C'), (11, 'Zoya', 19, 'A'), (12, 'EVA', 23, 'A'), (13, 'Ravi', 21, 'B'), (14, 'Sneha', 20, 'C'), (15, 'Zoya', 19, 'A'), (16, 'Ravi', 21, 'B'), (17, 'Sneha', 20, 'C'), (18, 'Zoya', 19, 'A'), (19, 'Ravi', 21, 'B'), (20, 'Sneha', 20, 'C'), (21, 'Zoya', 19, 'A'), (22, 'Alice', 20, 'A'), (23, 'Bob', 21, 'B'), (24, 'Charlie', 22, 'A'), (25, 'Dausy', 19, 'C')]
[(1, 'Alice', 20, 'B+'), (2, 'Bob', 21, 'B'), (4, 'Dausy', 19, 'C'), (5, 'EVA', 23, 'A'), (6, 'Ravi', 21, 'B'), (7, 'Sneha', 20, 'C'), (8, 'Zoya', 19, 'A'), (9, 'Ravi', 21, 'B'), (10, 'Sneha', 20, 'C'), (11, 'Zoya', 19, 'A'), (12, 'EVA', 23, 'A'), (13, 'Ravi', 21, 'B'), (14, 'Sneha', 20, 'C'), (15, 'Zoya', 19, 'A'), (16, 'Ravi', 21, 'B'), (17, 'Sneha', 20, 'C'), (18, 'Zoya', 19, 'A'), (19, 'Ravi', 21, 'B'), (20, 'Sneha', 20, 'C'), (21, 'Zoya', 19, 'A'), (22, 'Alice', 20, 'A'), (23, 'Bob', 21, 'B'), (24, 'Charlie', 22, 'A'), (25, 'Dausy', 19, 'C')]
[(1, 'Alice', 20, 'B+'), (2, 'Bob', 21, 'B'), (4, 'Dausy', 19, 'C'), (5, 'EVA', 23, 'A'), (6, 'Ravi', 21, 'B'), (7, 'Sneha', 20, 'C'), (8, 'Zoya', 19, 'A'), (9, 'Ravi', 21, 'B'), (10, 'Sneha', 20, 'C'), (11, 'Zoya', 19, 'A'), (12, 'EVA', 23, 'A'), (13, 'Ravi', 21, 'B'), (14, 'Sneha', 20, 'C'), (15, 'Zoya', 19, 'A'), (16, 'Ravi', 21, 'B'), (17, 'Sneha', 20, 'C'), (18, 'Zoya', 19, 'A'), (19, 'Ravi', 21, 'B'), (20, 'Sneha', 20, 'C'), (21, 'Zoya', 19, 'A'), (22, 'Alice', 20, 'A'), (23, 'Bob', 21, 'B'), (24, 'Charlie', 22, 'A'), (25, 'Dausy', 19, 'C')]
[(1, 'Alice', 20, 'B+'), (2, 'Bob', 21, 'B'), (4, 'Dausy', 19, 'C'), (5, 'EVA', 23, 'A'), (6, 'Ravi', 21, 'B'), (7, 'Sneha', 20, 'C'), (8, 'Zoya', 19, 'A'), (9, 'Ravi', 21, 'B'), (10, 'Sneha', 20, 'C'), (11, 'Zoya', 19, 'A'), (12, 'EVA', 23, 'A'), (13, 'Ravi', 21, 'B'), (14, 'Sneha', 20, 'C'), (15, 'Zoya', 19, 'A'), (16, 'Ravi', 21, 'B'), (17, 'Sneha', 20, 'C'), (18, 'Zoya', 19, 'A'), (19, 'Ravi', 21, 'B'), (20, 'Sneha', 20, 'C'), (21, 'Zoya', 19, 'A'), (22, 'Alice', 20, 'A'), (23, 'Bob', 21, 'B'), (24, 'Charlie', 22, 'A'), (25, 'Dausy', 19, 'C')]
[(1, 'Alice', 20, 'B+'), (2, 'Bob', 21, 'B'), (4, 'Dausy', 19, 'C'), (5, 'EVA', 23, 'A'), (6, 'Ravi', 21, 'B'), (7, 'Sneha', 20, 'C'), (8, 'Zoya', 19, 'A'), (9, 'Ravi', 21, 'B'), (10, 'Sneha', 20, 'C'), (11, 'Zoya', 19, 'A'), (12, 'EVA', 23, 'A'), (13, 'Ravi', 21, 'B'), (14, 'Sneha', 20, 'C'), (15, 'Zoya', 19, 'A'), (16, 'Ravi', 21, 'B'), (17, 'Sneha', 20, 'C'), (18, 'Zoya', 19, 'A'), (19, 'Ravi', 21, 'B'), (20, 'Sneha', 20, 'C'), (21, 'Zoya', 19, 'A'), (22, 'Alice', 20, 'A'), (23, 'Bob', 21, 'B'), (24, 'Charlie', 22, 'A'), (25, 'Dausy', 19, 'C')]
[(1, 'Alice', 20, 'B+'), (2, 'Bob', 21, 'B'), (4, 'Dausy', 19, 'C'), (5, 'EVA', 23, 'A'), (6, 'Ravi', 21, 'B'), (7, 'Sneha', 20, 'C'), (8, 'Zoya', 19, 'A'), (9, 'Ravi', 21, 'B'), (10, 'Sneha', 20, 'C'), (11, 'Zoya', 19, 'A'), (12, 'EVA', 23, 'A'), (13, 'Ravi', 21, 'B'), (14, 'Sneha', 20, 'C'), (15, 'Zoya', 19, 'A'), (16, 'Ravi', 21, 'B'), (17, 'Sneha', 20, 'C'), (18, 'Zoya', 19, 'A'), (19, 'Ravi', 21, 'B'), (20, 'Sneha', 20, 'C'), (21, 'Zoya', 19, 'A'), (22, 'Alice', 20, 'A'), (23, 'Bob', 21, 'B'), (24, 'Charlie', 22, 'A'), (25, 'Dausy', 19, 'C')]
[(1, 'Alice', 20, 'B+'), (2, 'Bob', 21, 'B'), (4, 'Dausy', 19, 'C'), (5, 'EVA', 23, 'A'), (6, 'Ravi', 21, 'B'), (7, 'Sneha', 20, 'C'), (8, 'Zoya', 19, 'A'), (9, 'Ravi', 21, 'B'), (10, 'Sneha', 20, 'C'), (11, 'Zoya', 19, 'A'), (12, 'EVA', 23, 'A'), (13, 'Ravi', 21, 'B'), (14, 'Sneha', 20, 'C'), (15, 'Zoya', 19, 'A'), (16, 'Ravi', 21, 'B'), (17, 'Sneha', 20, 'C'), (18, 'Zoya', 19, 'A'), (19, 'Ravi', 21, 'B'), (20, 'Sneha', 20, 'C'), (21, 'Zoya', 19, 'A'), (22, 'Alice', 20, 'A'), (23, 'Bob', 21, 'B'), (24, 'Charlie', 22, 'A'), (25, 'Dausy', 19, 'C')]
[(1, 'Alice', 20, 'B+'), (2, 'Bob', 21, 'B'), (4, 'Dausy', 19, 'C'), (5, 'EVA', 23, 'A'), (6, 'Ravi', 21, 'B'), (7, 'Sneha', 20, 'C'), (8, 'Zoya', 19, 'A'), (9, 'Ravi', 21, 'B'), (10, 'Sneha', 20, 'C'), (11, 'Zoya', 19, 'A'), (12, 'EVA', 23, 'A'), (13, 'Ravi', 21, 'B'), (14, 'Sneha', 20, 'C'), (15, 'Zoya', 19, 'A'), (16, 'Ravi', 21, 'B'), (17, 'Sneha', 20, 'C'), (18, 'Zoya', 19, 'A'), (19, 'Ravi', 21, 'B'), (20, 'Sneha', 20, 'C'), (21, 'Zoya', 19, 'A'), (22, 'Alice', 20, 'A'), (23, 'Bob', 21, 'B'), (24, 'Charlie', 22, 'A'), (25, 'Dausy', 19, 'C')]

In [8]:
# Update Date

cursor.execute("UPDATE students SET grade = ? WHERE name= ?", ("B+", "Alice"))
connection.commit()

In [9]:
rows = cursor.fetchall()
for row in rows:
    print(row)

In [10]:
# Delete the data
cursor.execute("DELETE FROM students WHERE name =?", ("Charlie",))
connection.commit()

cursor.execute("SELECT * FROM students")
connection.commit()
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Alice', 20, 'B+')
(2, 'Bob', 21, 'B')
(4, 'Dausy', 19, 'C')
(5, 'EVA', 23, 'A')
(6, 'Ravi', 21, 'B')
(7, 'Sneha', 20, 'C')
(8, 'Zoya', 19, 'A')
(9, 'Ravi', 21, 'B')
(10, 'Sneha', 20, 'C')
(11, 'Zoya', 19, 'A')
(12, 'EVA', 23, 'A')
(13, 'Ravi', 21, 'B')
(14, 'Sneha', 20, 'C')
(15, 'Zoya', 19, 'A')
(16, 'Ravi', 21, 'B')
(17, 'Sneha', 20, 'C')
(18, 'Zoya', 19, 'A')
(19, 'Ravi', 21, 'B')
(20, 'Sneha', 20, 'C')
(21, 'Zoya', 19, 'A')
(22, 'Alice', 20, 'B+')
(23, 'Bob', 21, 'B')
(25, 'Dausy', 19, 'C')

In [31]:
cursor.execute("DELETE From students")
connection.commit()

In [32]:
connection.close()

In [33]:
connection = sqlite3.connect('students.db')
cursor = connection.cursor()

# Create table
cursor.execute('''
CREATE TABLE IF NOT EXISTS students(
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT NOT NULL,
    age INTEGER,
    grade TEXT
)
''')

connection.commit()

In [34]:
cursor.execute('''
INSERT INTO students ('name','age','grade')
    VALUES('EVA',23,'A')
''')
connection.commit()

In [35]:
students = [("Ravi",21,"B"),("Sneha",20,"C"),("Zoya",19,"A")]
cursor.executemany("INSERT INTO students ('name','age','grade') VALUES(?,?,?)",students)

connection.commit()

In [13]:
cursor.execute("SELECT * FROM students")
connection.commit()

for row in cursor.fetchall():
    print(row)

(1, 'Alice', 20, 'B+')
(2, 'Bob', 21, 'B')
(4, 'Dausy', 19, 'C')
(5, 'EVA', 23, 'A')
(6, 'Ravi', 21, 'B')
(7, 'Sneha', 20, 'C')
(8, 'Zoya', 19, 'A')
(9, 'Ravi', 21, 'B')
(10, 'Sneha', 20, 'C')
(11, 'Zoya', 19, 'A')
(12, 'EVA', 23, 'A')
(13, 'Ravi', 21, 'B')
(14, 'Sneha', 20, 'C')
(15, 'Zoya', 19, 'A')
(16, 'Ravi', 21, 'B')
(17, 'Sneha', 20, 'C')
(18, 'Zoya', 19, 'A')
(19, 'Ravi', 21, 'B')
(20, 'Sneha', 20, 'C')
(21, 'Zoya', 19, 'A')
(22, 'Alice', 20, 'B+')
(23, 'Bob', 21, 'B')
(25, 'Dausy', 19, 'C')
(26, 'EVA', 23, 'A')
(27, 'Ravi', 21, 'B')
(28, 'Sneha', 20, 'C')
(29, 'Zoya', 19, 'A')

In [36]:
# Display all students sorted by age

cursor.execute("SELECT * FROM students ORDER BY age ASC")
sort_students = cursor.fetchall()
connection.commit()
for stu in sort_students:
    print(stu)

(37, 'Zoya', 19, 'A')
(36, 'Sneha', 20, 'C')
(35, 'Ravi', 21, 'B')
(34, 'EVA', 23, 'A')

In [18]:
cursor.execute("SELECT * FROM students WHERE grade IN (?,?)", ("B", "B+"))
connection.commit()
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Alice', 20, 'B+')
(2, 'Bob', 21, 'B')
(6, 'Ravi', 21, 'B')
(9, 'Ravi', 21, 'B')
(13, 'Ravi', 21, 'B')
(16, 'Ravi', 21, 'B')
(19, 'Ravi', 21, 'B')
(22, 'Alice', 20, 'B+')
(23, 'Bob', 21, 'B')
(27, 'Ravi', 21, 'B')

In [37]:
cursor.execute("SELECT COUNT(*) FROM students WHERE grade='A'")
connection.commit()

rows = cursor.fetchall()
for row in rows:
    print(row)

(2,)

In [23]:
# Get all students whose names start with the letter "s".

cursor.execute("SELECT * FROM students WHERE name LIKE 's%'")
connection.commit()
for row in cursor.fetchall():
    print(row)

(7, 'Sneha', 20, 'C')
(10, 'Sneha', 20, 'C')
(14, 'Sneha', 20, 'C')
(17, 'Sneha', 20, 'C')
(20, 'Sneha', 20, 'C')
(28, 'Sneha', 20, 'C')

In [38]:
cursor.execute("UPDATE students SET grade= ? WHERE name =?", ('A+',"Zoya"))
connection.commit()

In [41]:
cursor.execute("UPDATE students SET age =age+1")
connection.commit()

In [42]:
cursor.execute("SELECT * FROM students")

for row in cursor.fetchall():
    print(row)

(34, 'EVA', 24, 'A')
(35, 'Ravi', 22, 'B')
(36, 'Sneha', 21, 'C')
(37, 'Zoya', 20, 'A+')

In [46]:
cursor.execute("SELECT * FROM students")

for row in cursor.fetchone():
    print(row)

34
EVA
24
A

In [47]:
for row in cursor.fetchmany():
    print(row)

(35, 'Ravi', 22, 'B')

In [49]:
cursor.execute("SELECT * FROM students WHERE age >? OR grade= ?", (20, "A"))
connection.commit()

for row in cursor.fetchall():
    print(row)

(34, 'EVA', 24, 'A')
(35, 'Ravi', 22, 'B')
(36, 'Sneha', 21, 'C')

In [52]:
cursor.execute("SELECT * FROM students WHERE age >=20 ORDER BY age ASC")
connection.commit()

for row in cursor.fetchall():
    print(row)

(37, 'Zoya', 20, 'A+')
(36, 'Sneha', 21, 'C')
(35, 'Ravi', 22, 'B')
(34, 'EVA', 24, 'A')

In [58]:
# Fetch students with grade "A" and age under 22.

cursor.execute("SELECT * FROM students WHERE grade= ? AND age <=?", ('A','22'))
connection.commit()

for row in cursor.fetchall():
    print(row)

In [60]:
# Find students whose grades are in ("A","B", "B+")

cursor.execute("SELECT * FROM students WHERE grade IN ('A','B','B+')")
connection.commit()

for row in cursor.fetchall():
    print(row)

(34, 'EVA', 24, 'A')
(35, 'Ravi', 22, 'B')

In [62]:
cursor.execute("SELECT * FROM students WHERE grade NOT IN ('C','D')")
connection.commit()

for row in cursor.fetchall():
    print(row)

(34, 'EVA', 24, 'A')
(35, 'Ravi', 22, 'B')
(37, 'Zoya', 20, 'A+')

In [63]:
cursor.execute("SELECT * FROM students WHERE name LIKE 'S%'")
connection.commit()

for row in cursor.fetchall():
    print(row)

(36, 'Sneha', 21, 'C')

In [64]:
cursor.execute("SELECT * FROM students WHERE name LIKE '%A' ")
connection.commit()

for row in cursor.fetchall():
    print(row)

(34, 'EVA', 24, 'A')
(36, 'Sneha', 21, 'C')
(37, 'Zoya', 20, 'A+')

In [69]:
cursor.execute("SELECT * FROM students ORDER BY age DESC LIMIT 3")
connection.commit()

for row in cursor.fetchall():
    print(row)

(34, 'EVA', 24, 'A')
(35, 'Ravi', 22, 'B')
(36, 'Sneha', 21, 'C')

In [72]:
cursor.execute("SELECT * FROM students ORDER BY name DESC")
connection.commit()

for row in cursor.fetchall():
    print(row)

(37, 'Zoya', 20, 'A+')
(36, 'Sneha', 21, 'C')
(35, 'Ravi', 22, 'B')
(34, 'EVA', 24, 'A')

In [ ]:
## Prevent SQL Injection Using
'''
# Bad (vulnerable to SQL injection)
cursor.execute(f"SELECT * FROM students WHERE name ='{user_input}'")

# GOOD safe
cursor.execute("SELECT * FROM students WHERE name = ?", (user_input,))

'''

In [77]:
with sqlite3.connect("student.db") as connection:
    cursor = connection.cursor()
    cursor.execute('''
    CREATE TABLE IF NOT EXISTS student (
        id INTEGER PRIMARY KEY AUTOINCREMENT,
        name TEXT,
        age INTEGER,
        grade TEXT
    )
    ''')
    connection.commit()

In [79]:
import sqlite3

def insert_student(name, age, grade):
    with sqlite3.connect("student.db") as connection:
        cursor = connection.cursor()
        cursor.execute("INSERT INTO student (name, age, grade) VALUES (?, ?, ?)", (name, age, grade))
        connection.commit()
        print(f"{name} inserted successfully.")

# Get input from user
name = input("Enter student name: ")
age = int(input("Enter age: "))
grade = input("Enter grade (A/B/C): ")

insert_student(name, age, grade)

xitij inserted successfully.